/*
    1. Трикутник.
    Напишіть цикл, котрий виводить такий трикутник:

    #
    ##
    ###
    ####
    #####
    ######
    #######
*/

/*
    2. Шахова дошка.
    Напишіть програму, що створює 8 рядків з 8 символів,
    поділених символами нового рядка(\n). На кожній позиції пробіл або #.
    Кожний перший рядок повинен починатися з решітки, а кожен другий з пробілу.
    В результаті має вийти шахова дошка:

    # # # #
     # # # #
    # # # #
     # # # #
    # # # #
     # # # #
    # # # #
     # # # #
*/


/*
    3. FizzBuzz.
    Напишіть програму, яка виводить через console.log усі числа від 1 до 100,
    із двома винятками. Для чисел, що націло діляться на 3, вона повинна виводити
    'Fizz', а чисел, які діляться на 5 (але з 3) – 'Buzz'.
    
    Коли зумієте - виправте її так, щоб вона виводила FizzBuzz для всіх чисел,
    які діляться і 3 і 5.
*/

