/* 
    1. Створити проект
    2. Додоати до проекта бібліотеку ts-node для запуску TypeScript;
    3. Створити скрипт для запуску проекту мовою TypeScript;
    4. У проекты зробити наступне:
        4.1. Створити класи Animal, Cat, Dog;
        4.2. Cтворити інтерфейс IPet з полями name та age;
        4.3. Реалізувати клас Animal за інтерфейсом IPet;
        4.4. Успадкувати клас Animal класами Cat та Dog;
        4.5. Додати до класів Animal, Cat, Dog методи з подифікаторами public, private та protected.
*/

