/*
  Анаграми – це слова, які мають ті ж літери в тій самій кількості, але вони розташовуються в іншому порядку.

  nap - pan
  ear - are - era
  cheaters - hectares - teachers

  Задача:
  Напишіть функцію, яка приймає в параметр масив і повертає масив слів, очищений від анаграм.
  У функції треба використати Set або Map.

  Наприклад:
  Приймає: ["nap", "teachers", "ChEaTeRs", "PAN", "ear", "Era", "Hectares"];
  Повертає: ["nap", "teachers", "ear"] або ["PAN", "ChEaTeRs", "Era"];

  З кожної групи анаграм має залишитися тільки одне слово, не важливо яке.
*/