{
    "title": "Big George Foreman: No longer in the ring but not out of the spotlight",
    "description": "One of boxing's most famous champions, George Foreman is perhaps best known for his 'Rumble In The Jungle' with Muhammad Ali. That and his George Foreman grill. Sky News sat down with the star and asked him about both.",
    "article": "Heavyweight champion, Christian minister, Olympic champion, and businessman - for seven decades George Foreman has delivered knockout blows in and out of the ring.\nNicknamed 'Big George,' the Olympic Gold medallist is one of boxing's most famous champions, known as one of the most fearsome punchers of all time.\nAnd now Foreman is back in the spotlight in a new biopic about his life, from growing up in 1950s Texas to becoming the oldest heavyweight champion of the world.\nAsked about his infamous 1974 fight against Muhammad Ali dubbed 'Rumble In The Jungle', the boxer told Sky News it was 'real painful to watch' but said his defeat led the pair to become the 'best of friends'.\nHeld in Kinshasa, Zaire (now the Democratic Republic of the Congo), 25-year-old Foreman was favourite to beat Muhammad Ali, who was then 32, having won 40 of his previous fights without defeat.\nSpeaking about the fight, Foreman, 74, said: 'I watched it for a little while, it was real painful to watch. Then I'd watch it because I started teaching other boxers about boxing techniques. I watched because it became something that I had in common with the great Muhammad Ali, we became the best of friends'.\nAt 6ft 4ins and known for his devastating punches, 'Big George' had Ali on the ropes in the early rounds but 'The Greatest' refused to go down. It was in the eighth round that Ali won by knockout.Not only was it Foreman's first defeat as a professional, it was the first time he had hit the canvas in his career.\n Foreman recalls: 'I was shocked after three rounds and he [Ali] was still on his feet. He would talk about all of his exploits, but he didn't want to bring up beating me. I'd say 'yeah, you defeated me'. I still miss him today. Somehow, he still stays alive in me.'\nEntering the ring to the crowd chanting 'Ali, bomaye' translating to 'Ali, kill him,' Foreman says he was aware of the chanting but remained unfazed by the hostile crowd.\n'Oh yeah, that didn't bother me. I was the bad guy because I was knocking out everybody and I wanted to knock him out as well. So, it doesn't matter what people scream, it was what I was gonna do in the ring.'\nActor Khris Davis, who plays George Foreman in the film described the former Olympic champion as an inspiration.\n'I encountered a lot of challenging moments during this film, and he encountered a lot of challenging moments during his life. Mr Foreman had to meet his challenges face to face.\n'So, as I was doing this, I was seeing how far I could be pushed, and what I could do to overcome those challenges. So, I think moving forward in my life, I'll always hold that with me.'\nAfter a 10-year hiatus from the sport, struggling financially and spiritually, 45-year-old George Foreman made history by reclaiming his title, becoming the oldest World Heavyweight Boxing Champion ever.\nRetiring in 1997, his successful career was recognised in 2003 when he was inducted into the International Boxing Hall of Fame.\nDirector of the film George Tillman Junior says George Foreman's life story can be a message to young Americans who may have been written off.\n'The idea that you can really put your mind to it and get to where you want to be. And forget the clichés - let's talk about the subtext, you could change your mindset and be different in how you do things.\n'You can do it in a way that can be helpful for yourself or helpful for others. And I think that's the inspiring story that people will be able to take away.'\nOutside of the ring, Foreman who has 12 children including five boys all named George, is known for the kitchen gadget the George Foreman grill.\nOn whether he still owns one he laughs saying: 'How many of them do I own? You know because George doesn't like meat so he has to have his private grill but George loves hot dogs and then George loves hamburger you got all these George's for all of these grills it gets out of hand.'\nBig George Foreman: The Miraculous Story of the Once and Future Heavyweight Champion of the World is in cinemas on Friday 28 April.",
    "date": "Tuesday 25 April 2023 04:52",
    "image": "https://e3.365dm.com/23/04/1600x900/skynews-george-foreman-muhammad-ali_6131988.jpg?20230424155513"
}