[
    {
        "title": "Elon Musk statements about Tesla Autopilot could be 'deepfakes', lawyers claim",
        "description":"Judge Evette Pennypacker says claims by Tesla's lawyers that the businessman was the subject of 'deepfakes' could be used by high-profile celebrities to 'avoid taking ownership' of their public statements.",
        "date": "Thursday 27 April 2023 11:41",
        "image": "https://e3.365dm.com/23/04/1600x900/skynews-elon-musk-twitter_6116928.jpg?20230410104837"
    },
    {
        "title": "Elizabeth Holmes: Disgraced Theranos founder delays going to jail after winning appeal",
        "description":"Her company, a Silicon Valley sensation, claimed it could test for dozens of diseases from a single blood test, but when the tech turned out to be flawed, the founder was jailed for more than 11 years.",
        "date": "Thursday 27 April 2023 13:12",
        "image": "https://e3.365dm.com/23/04/1600x900/skynews-elizabeth-holmes-theranos_6118789.jpg?20230412093037"
    },
    {
        "title": "Microsoft blocked in bid to buy video game maker Activision Blizzard - but vows to respond",
        "description":"The CMA stops Microsoft's proposed purchase of Activision Blizzard over concerns the deal will lead to reduced innovation and less choice for UK gamers - but both companies say they have not given up yet.",
        "date": "Wednesday 26 April 2023 16:38",
        "image": "https://e3.365dm.com/22/12/1600x900/skynews-microsoft-activision_5991001.jpg?20221209092731"
    },
    {
        "title": "Astronomers solve mystery about quasars - and the likely future of the Milky Way",
        "description":"Quasars are objects of very high luminosity found in the centres of some galaxies and can be a trillion times brighter than the sun.",
        "date": "Wednesday 26 April 2023 01:42",
        "image": "https://e3.365dm.com/23/04/1600x900/skynews-quasars-astronomy_6133461.jpg?20230425224707"
    },
    {
        "title": "Supermassive black hole shown firing out mysterious jet in first ever image of phenomenon captured by astronomers",
        "description":"The supermassive black hole has a mass billions of times that of the sun and is around 55 million light-years from Earth. Scientists used data gathered from more than a dozen telescopes worldwide to compile the picture.",
        "date": "Wednesday 26 April 2023 19:04",
        "image": "https://e3.365dm.com/23/04/1600x900/skynews-black-hole-space-technology_6134300.jpg?20230426171807"
    },
    {
        "title": "First private moon landing appears to have failed",
        "description":"Japan's ispace Inc hoped the Hakuto-R lander would touch down on the moon - but contact has been lost.",
        "date": "Tuesday 25 April 2023 19:48",
        "image": "https://e3.365dm.com/23/04/1600x900/skynews-moon-lander-ispace_6133253.jpg?20230425191204"
    }
]